Revit 2026 API
BoundaryConditions.Point Property
 Returns the position of point boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public XYZ Point { get; }
Public ReadOnly Property Point As XYZ
	Get
public:
property XYZ^ Point {
	XYZ^ get ();
}
member Point : XYZ with get
Property Value
XYZ
Exceptions
Exception | Condition
InvalidObjectException |  Thrown when BoundaryConditions is not a BoundaryConditionsType::Point type.
Remarks
 Boundary conditions should be BoundaryConditionsType::Point type. Otherwise exception is thrown.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace